[{
	"text": "На сколько правильно вы устанавливаете распорядок рабочего дня?",
	"options": [{
		"text": "Опаздываю, никогда не укладываюсь в сроки.",
		"weights": [0.0, 0.0, 0.0]
	}, {
		"text": "Иногда не успеваю, откладываю на следующий день.",
		"weights": [0.5, 0.1, 0.1]
	}, {
		"text": "Если не успеваю, остаюсь на вечер.",
		"weights": [0.3, 0.3, 0.2]
	}, {
		"text": "Ценю свою время, прикладываю все усилия чтобы уложиться в срок.",
		"weights": [0.2, 0.4, 0.6]
	}, {
		"text": "Всегда делаю все вовремя.",
		"weights": [0.0, 0.2, 0.1]
	}]
}, {
	"text": "Как часто вы принимаете самостоятельные решения?",
	"options": [{
		"text": "Никогда не принимаю решения (на это есть начальник/старший разработчик).",
		"weights": [0.6, 0.0, 0.0]
	}, {
		"text": "Принимаю самостоятельно решения, когда это необходимо.",
		"weights": [0.4, 0.0, 0.0]
	}, {
		"text": "Хорошо ориентируюсь в проекте - могу предложить несколько рабочих вариантов решения проблемы.",
		"weights": [0.0, 0.7, 0.1]
	}, {
		"text": "Знаю проект и принимаю решения самостоятельно (готов отвечать за свой выбор).",
		"weights": [0.0, 0.3, 0.4]
	}, {
		"text": "Всегда принимаю важные решения самостоятельно (вне зависимости от сложности и важности задачи).",
		"weights": [0.0, 0.0, 0.5]
	}]
}, {
	"text": "Способны ли вы делегировать полномочия?",
	"options": [{
		"text": "Никогда не делегирую задачи. Сделаю всё сам, но зато правильно и проверять не надо!",
		"weights": [1.0, 0.2, 0.0]
	}, {
		"text": "Могу отдать маленькую подзадачу на менее опытного сотрудника. Если не справится - не критично, сам исправлю.",
		"weights": [0.0, 0.6, 0.0]
	}, {
		"text": "Хорошо делю задачи на логические части, знаю кто из сотрудников с чем справится.",
		"weights": [0.0, 0.2, 0.2]
	}, {
		"text": "Грамотно и быстро могу разделить/объединить задачи, сам выполняю не обязательно главную часть. Разбираюсь в проделанной работе.",
		"weights": [0.0, 0.0, 0.3]
	}, {
		"text": "Прекрасно управляюсь с множеством задач. Могу заниматься лишь их описанием и проверкой результата, не написав ни единой строчки кода.",
		"weights": [0.0, 0.0, 0.4]
	}]
}, {
	"text": "Насколько точно вы оцениваете время выполнения задачи?",
	"options": [{
		"text": "Не умею оценивать задачи (никогда не пробовал).",
		"weights": [0.4, 0.0, 0.0]
	}, {
		"text": "Ошибаюсь в оценке не более чем на 1/3 от реального времени.",
		"weights": [0.4, 0.2, 0.0]
	}, {
		"text": "Могу оценить аналогичную задачу (ранее выполненную).",
		"weights": [0.2, 0.3, 0.2]
	}, {
		"text": "Могу разделить задачу, оценить каждую часть и посчитать сумму.",
		"weights": [0.0, 0.4, 0.6]
	}, {
		"text": "Знаю сколько времени будет потрачено (основываюсь на личном опыте).",
		"weights": [0.0, 0.1, 0.2]
	}]
}, {
	"text": "Насколько грамотно вы можете ставить и описывать задачи по проекту?",
	"options": [{
		"text": "Не общаюсь с людьми, затрудняюсь выражать мысли любым способом.",
		"weights": [0.6, 0.0, 0.0]
	}, {
		"text": "Не описываю задачи. Если будет необходимость, коллеги сами у меня все спросят.",
		"weights": [0.2, 0.0, 0.0]
	}, {
		"text": "Могу сформулировать суть задачи, объяснить, что может быть предпринято для её решения",
		"weights": [0.2, 0.4, 0.0]
	}, {
		"text": "Могу всегда коротко и ясно изложить суть задачи.",
		"weights": [0.0, 0.4, 0.0]
	}, {
		"text": "Расписываю/объясняю всё точно, поэтапно (возможно с примерами или указаниями на возможные решения).",
		"weights": [0.0, 0.2, 1.0]
	}]
}, {
	"text": "Можете ли вы найти оптимальное решение проблемы?",
	"options": [{
		"text": "Оптимальные решения - это не моё!",
		"weights": [0.0, 0.0, 0.0]
	}, {
		"text": "Нахожу решение задачи. Делаю так, чтобы все просто работало.",
		"weights": [0.4, 0.0, 0.0]
	}, {
		"text": "Нахожу более-менее оптимальное решение. Реализую, но не делаю попыток еще раз его переосмыслить. Потом если и найду решение, то промолчу об этом.",
		"weights": [0.3, 0.0, 0.0]
	}, {
		"text": "Нахожу оптимальное решение. Реализую его, однако не делаю попыток еще раз его переосмыслить. Если потом все же найду решение лучше, то немедленно вынесу вопрос о его внедрении.",
		"weights": [0.2, 0.5, 0.0]
	}, {
		"text": "Всегда проверяю оптимальность решения задачи. Если в будущем найду лучшее решение, то вынесу вопрос о его внедрении в проект.",
		"weights": [0.1, 0.5, 1.0]
	}]
}, {
	"text": "Умеете ли вы решать “нерешаемые” задачи?",
	"options": [{
		"text": "Почти не ищу решения. Сдаюсь, при этом никому ничего не говорю (все думают, что я в процессе решения и справлюсь до дня \"X\")",
		"weights": [0.1, 0.0, 0.0]
	}, {
		"text": "Бегло погуглю. Могу испугаться, буду просить помощи более опытного разработчика взяться за решение проблемы.",
		"weights": [0.7, 0.0, 0.0]
	}, {
		"text": "Погуглю. Поищу нужную информацию. Поспрашиваю может кто-что знает. Найду решение в конце концов, но затратив много времени.",
		"weights": [0.2, 0.2, 0.0]
	}, {
		"text": "Погуглю, посмотрю tutorial-ы, спрошу у коллег. Задачу решу! Но бывает “встаю в ступор” над подобными задачами.",
		"weights": [0.0, 0.5, 0.5]
	}, {
		"text": "Умею гуглить, найду что-нибудь на \"stack overflow\" или подсмотрю интересный алгоритм, спрошу у коллег. Умею решать задачи поэтапно, полон идей,\"нерешаемых\" задач не бывает!",
		"weights": [0.0, 0.3, 0.5]
	}]
}]